; domain
; This domain adds to the latest domain from all-cost and has the following characteristics:
; is for transporting cargo from location to location using planes and trucks.
; has a cost for every action
; Keeps track of time using static predicates 
; uses similar technique of time to keep track of capacity levels (code idea from IPC 2014 domain) 

(define(domain capacity-transport)

    (:requirements :action-costs :typing)

    (:predicates

        (in ?object ?location)
        (at ?object ?location)
        (location ?location)
        (cargo ?object)
        (plane ?object)
        (airport ?object)
        (truck ?object)
        (day-to-day ?day1 ?day2) ; day-to-day is a static predicate that keeps track of time for the actions fly and drive 
        (current_time ?day1) ; keeps track of the current time

        ; capcaity predicates
        ; the capacity of a vehicle in a hierarchical way
        ; each x represents a capacity level
        (capacity ?vehicle ?x1)
        ; indicates that one capacity level is a lower capacity than another
        (capacity-counter ?x1 ?x2)

    )

    (:functions
        ; function to keep track of costs
        (total-cost) - number
    )
    ; loads cargo to the plane.
    ; the action load has a cost of 2 units
    (:action load
        :parameters (?cargo ?plane ?airport ?x1 ?x2)
        :precondition (and (at ?cargo ?airport)
            (at ?plane ?airport)
            (cargo ?cargo)
            (plane ?plane)
            (airport ?airport)
            (capacity-counter ?x1 ?x2)
            (capacity ?plane ?x2)
        )
        :effect (and (not (at ?cargo ?airport))
            (in ?cargo ?plane)
            (capacity ?plane ?x1)
            (not (capacity ?plane ?x2))
            (increase (total-cost) 2))
    )
    ; unloads cargo from the plane to the airport
    ; the action unload has a cost of 2 units
    (:action unload
        :parameters (?cargo ?plane ?airport ?x1 ?x2)
        :precondition (and (in ?cargo ?plane)
            (at ?plane ?airport)
            (cargo ?cargo)
            (plane ?plane)
            (airport ?airport)
            (capacity-counter ?x1 ?x2)
            (capacity ?plane ?x1)
        )
        :effect (and (not (in ?cargo ?plane))
            (at ?cargo ?airport)
            (capacity ?plane ?x2)
            (not (capacity ?plane ?x1))
            (increase (total-cost) 2))
    )
    ; fly from ariport to another airport
    ; this action uses day-to-day predicate and populate it, in other words the action takes on day to complete.
    ; sets the current time has to be specifed in init state and one of the effects of fly action is to set the current time to next day.
    ; the action fly has a cost of 5 units  
    (:action fly
        :parameters (?plane ?from ?to ?day1 ?day2)
        :precondition (and
            (at ?plane ?from)
            (plane ?plane)
            (airport ?from)
            (airport ?to)
            (current_time ?day1)
            (day-to-day ?day1 ?day2)
        )
        :effect (and
            (not (at ?plane ?from))
            (at ?plane ?to)
            (increase (total-cost) 5)
            (not (current_time ?day1))
            (current_time ?day2)
        )
    )
    ; drive from location to location
    ; this action uses day-to-day and current-time just like fly action above
    ; the action drive has a cost of 3 units 
    (:action drive
        :parameters (?truck ?from ?to ?day1 ?day2)
        :precondition (and(at ?truck ?from)
            (truck ?truck)
            (location ?from)
            (location ?to)
            (current_time ?day1)
            (day-to-day ?day1 ?day2)
        )
        :effect (and
            (not (At ?truck ?from))
            (at ?truck ?to)
            (increase (total-cost) 3)
            (not (current_time ?day1))
            (current_time ?day2)
        )
    )
    ; pick-up cargo from a location and put on the truck 
    ; the action has a cost of 1 unit
    (:action pick-up
        :parameters (?cargo ?truck ?location ?x1 ?x2)
        :precondition (and (at ?cargo ?location)
            (at ?cargo ?location)
            (at ?truck ?location)
            (cargo ?cargo)
            (truck ?truck)
            (Location ?location)
            (capacity-counter ?x1 ?x2)
            (capacity ?truck ?x2)
        )
        :effect (and
            (not (at ?cargo ?location))
            (in ?cargo ?truck)
            (capacity ?truck ?x1)
            (not (capacity ?truck ?x2))
            (increase (total-cost) 1)
        )
    )
    ; drop cargo from the truck to the location
    ; the action has a cost of 1 unit
    (:action drop
        :parameters (?cargo ?truck ?location ?x1 ?x2)
        :precondition (and (in ?cargo ?truck)
            (at ?truck ?location)
            (cargo ?cargo)
            (truck ?truck)
            (location ?location)
            (capacity-counter ?x1 ?x2)
            (capacity ?truck ?x1)
        )
        :effect (and
            (not (in ?cargo ?truck))
            (at ?cargo ?location)
            (capacity ?truck ?x2)
            (not (capacity ?truck ?x1))
            (increase (total-cost) 1)
        )
    )
)

; problem
; Generated with complex_render.py using Jinja2 templating tool. 
; Needs a bit of formatting after the file creation to make the problem file look nicer and more readable. 
; The goal section of the template does not work and has to be coded manually(to have all cargo objects in the desired locations and not just in order) 

(define (problem ComplexTransport)
    (:domain capacity-transport)

    (:objects
        cargo1 cargo2 cargo3 cargo4 cargo5 cargo6 cargo7 cargo8 cargo9 cargo10 plane1 plane2 plane3 truck1 truck2 truck3 london egham tokyo shiraz beijing seoul newyork losangeles sydney 
        d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11 d12 d13 d14 d15 d16 d17 d18 d19 d20 x0 x1 x2 x3 x4 x5 x6
    )

    (:init
        (= (total-cost) 0)

        (current_time d1)

        (day-to-day d1 d2)
        (day-to-day d2 d3)
        (day-to-day d3 d4)
        (day-to-day d4 d5)
        (day-to-day d5 d6)
        (day-to-day d6 d7)
        (day-to-day d7 d8)
        (day-to-day d8 d9)
        (day-to-day d9 d10)
        (day-to-day d10 d11)
        (day-to-day d11 d12)
        (day-to-day d12 d13)
        (day-to-day d13 d14)
        (day-to-day d14 d15)
        ; (day-to-day d15 d16)
        ; (day-to-day d16 d17)
        ; (day-to-day d17 d18)
        ; (day-to-day d18 d19)
        ; (day-to-day d19 d20)

        (Cargo cargo1)
        (Cargo cargo2)
        (Cargo cargo3)
        (Cargo cargo4)
        (Cargo cargo5)
        (Cargo cargo6)
        (Cargo cargo7)
        (Cargo cargo8)
        (Cargo cargo9)
        (Cargo cargo10)

        (Plane plane1)
        (Plane plane2)
        (Plane plane3)

        (Truck truck1)
        (Truck truck2)
        (Truck truck3)

        (Location london)
        (Airport london)
        (Location egham)
        (Airport egham)
        (Location tokyo)
        (Airport tokyo)
        (Location shiraz)
        (Airport shiraz)
        (Location beijing)
        (Airport beijing)
        (Location seoul)
        (Airport seoul)
        (Location newyork)
        (Airport newyork)
        (Location losangeles)
        (Airport losangeles)
        (Location sydney)
        (Airport sydney)

        (At cargo1 london)
        (At cargo2 london)
        (At cargo3 egham)
        (At cargo4 egham)
        (At cargo5 tokyo)
        (At cargo6 shiraz)
        (At cargo7 beijing)
        (At cargo8 seoul)
        (At cargo9 newyork)
        (At cargo10 losangeles)

        (At truck1 london)
        (At truck2 egham)
        (At truck3 tokyo)

        (At plane1 shiraz)
        (At plane2 beijing)
        (At plane3 seoul)

        (capacity-counter x0 x1)
        (capacity-counter x1 x2)
        (capacity-counter x2 x3)
        (capacity-counter x3 x4)
        (capacity-counter x4 x5)
        (capacity-counter x5 x6)

        (capacity truck1 x5)
        (capacity truck2 x3)
        (capacity truck3 x2)
        (capacity plane1 x1)
        (capacity plane2 x3)
        (capacity plane3 x4)
    )

    (:goal
        (and
            (At cargo1 egham)
            (At cargo2 london)
            (At cargo3 tokyo)
            (At cargo4 sydney)
            (At cargo5 london)
            (At cargo6 egham)
            (At cargo7 newyork)
            (At cargo8 london)
            (At cargo9 egham)
            (At cargo10 tokyo)
        )
    )
)

; plan
1. (load cargo7 plane2 beijing x2 x3)
   deleted: (at cargo7 beijing) (capacity plane2 x3)
   added: (in cargo7 plane2) (capacity plane2 x2)
   goals met: 1 of 10
2. (fly plane2 beijing newyork d1 d2)
   deleted: (at plane2 beijing) (current_time d1)
   added: (at plane2 newyork) (current_time d2)
   goals met: 1 of 10
3. (unload cargo7 plane2 newyork x2 x3)
   deleted: (in cargo7 plane2) (capacity plane2 x2)
   added: (at cargo7 newyork) (capacity plane2 x3)
   goals met: 2 of 10
4. (load cargo8 plane3 seoul x3 x4)
   deleted: (at cargo8 seoul) (capacity plane3 x4)
   added: (in cargo8 plane3) (capacity plane3 x3)
   goals met: 2 of 10
5. (fly plane3 seoul london d2 d3)
   deleted: (at plane3 seoul) (current_time d2)
   added: (at plane3 london) (current_time d3)
   goals met: 2 of 10
6. (unload cargo8 plane3 london x3 x4)
   deleted: (in cargo8 plane3) (capacity plane3 x3)
   added: (at cargo8 london) (capacity plane3 x4)
   goals met: 3 of 10
7. (load cargo9 plane2 newyork x2 x3)
   deleted: (at cargo9 newyork) (capacity plane2 x3)
   added: (in cargo9 plane2) (capacity plane2 x2)
   goals met: 3 of 10
8. (fly plane2 newyork egham d3 d4)
   deleted: (at plane2 newyork) (current_time d3)
   added: (at plane2 egham) (current_time d4)
   goals met: 3 of 10
9. (unload cargo9 plane2 egham x2 x3)
   deleted: (in cargo9 plane2) (capacity plane2 x2)
   added: (at cargo9 egham) (capacity plane2 x3)
   goals met: 4 of 10
10. (load cargo1 plane3 london x3 x4)
   deleted: (at cargo1 london) (capacity plane3 x4)
   added: (in cargo1 plane3) (capacity plane3 x3)
   goals met: 4 of 10
11. (fly plane3 london egham d4 d5)
   deleted: (at plane3 london) (current_time d4)
   added: (at plane3 egham) (current_time d5)
   goals met: 4 of 10
12. (unload cargo1 plane3 egham x3 x4)
   deleted: (in cargo1 plane3) (capacity plane3 x3)
   added: (at cargo1 egham) (capacity plane3 x4)
   goals met: 5 of 10
13. (load cargo4 plane2 egham x2 x3)
   deleted: (at cargo4 egham) (capacity plane2 x3)
   added: (in cargo4 plane2) (capacity plane2 x2)
   goals met: 5 of 10
14. (fly plane2 egham sydney d5 d6)
   deleted: (at plane2 egham) (current_time d5)
   added: (at plane2 sydney) (current_time d6)
   goals met: 5 of 10
15. (unload cargo4 plane2 sydney x2 x3)
   deleted: (in cargo4 plane2) (capacity plane2 x2)
   added: (at cargo4 sydney) (capacity plane2 x3)
   goals met: 6 of 10
16. (load cargo3 plane3 egham x3 x4)
   deleted: (at cargo3 egham) (capacity plane3 x4)
   added: (in cargo3 plane3) (capacity plane3 x3)
   goals met: 6 of 10
17. (fly plane3 egham tokyo d6 d7)
   deleted: (at plane3 egham) (current_time d6)
   added: (at plane3 tokyo) (current_time d7)
   goals met: 6 of 10
18. (unload cargo3 plane3 tokyo x3 x4)
   deleted: (in cargo3 plane3) (capacity plane3 x3)
   added: (at cargo3 tokyo) (capacity plane3 x4)
   goals met: 7 of 10
19. (load cargo6 plane1 shiraz x0 x1)
   deleted: (at cargo6 shiraz) (capacity plane1 x1)
   added: (in cargo6 plane1) (capacity plane1 x0)
   goals met: 7 of 10
20. (fly plane1 shiraz egham d7 d8)
   deleted: (at plane1 shiraz) (current_time d7)
   added: (at plane1 egham) (current_time d8)
   goals met: 7 of 10
21. (unload cargo6 plane1 egham x0 x1)
   deleted: (in cargo6 plane1) (capacity plane1 x0)
   added: (at cargo6 egham) (capacity plane1 x1)
   goals met: 8 of 10
22. (load cargo5 plane3 tokyo x3 x4)
   deleted: (at cargo5 tokyo) (capacity plane3 x4)
   added: (in cargo5 plane3) (capacity plane3 x3)
   goals met: 8 of 10
23. (fly plane3 tokyo london d8 d9)
   deleted: (at plane3 tokyo) (current_time d8)
   added: (at plane3 london) (current_time d9)
   goals met: 8 of 10
24. (unload cargo5 plane3 london x3 x4)
   deleted: (in cargo5 plane3) (capacity plane3 x3)
   added: (at cargo5 london) (capacity plane3 x4)
   goals met: 9 of 10
25. (drive truck3 tokyo losangeles d9 d10)
   deleted: (at truck3 tokyo) (current_time d9)
   added: (at truck3 losangeles) (current_time d10)
   goals met: 9 of 10
26. (pick-up cargo10 truck3 losangeles x1 x2)
   deleted: (at cargo10 losangeles) (capacity truck3 x2)
   added: (in cargo10 truck3) (capacity truck3 x1)
   goals met: 9 of 10
27. (drive truck3 losangeles tokyo d10 d11)
   deleted: (at truck3 losangeles) (current_time d10)
   added: (at truck3 tokyo) (current_time d11)
   goals met: 9 of 10
28. (drop cargo10 truck3 tokyo x1 x2)
   deleted: (in cargo10 truck3) (capacity truck3 x1)
   added: (at cargo10 tokyo) (capacity truck3 x2)
   goals met: 10 of 10
